Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: @xref{Strings of Events}, for special considerations for strings of keyboard character events.
fr_fr: @xref{Strings of Events}, pour des informations particulières sur les chaînes des événements liés aux caractères clavier.

source: @xref{Text Comparison}, for functions that compare strings; some of them ignore case differences, or can optionally ignore case differences.
fr_fr: @xref{Text Comparison}, pour les fonctions qui comparent des chaînes; certains d'entre eux ignorent les différences de casse, ou peut éventuellement ignorer les différences de casse.

source: @xref{Text}, for information about functions that display strings or copy them into buffers. @xref{Character Type}, and @ref{String Type}, for information about the syntax of characters and strings. @xref{Non-ASCII Characters}, for functions to convert between text representations and to encode and decode character codes.
fr_fr: >@xref{Text}, pour plus d’informations sur les fonctions qui affichent des chaînes ou les copient dans une mémoire tampon. Voir la section @xref{Character Type}, et @xref{String Type}, pour plus d’informations sur la syntaxe des chaînes et des caractères. @xref{Non-ASCII Characters}, les fonctions pour faire des conversions entre des représentations textuelles et pour coder et décoder des codes caractères.

source: A @code{wrong-type-argument} error is signaled if @var{start} is not an integer or if @var{end} is neither an integer nor @code{nil}. An @code{args-out-of-range} error is signaled if @var{start} indicates a character following @var{end}, or if either integer is out of range for @var{string}.
fr_fr: Une erreur de type @code{wrong-type-argument} est soulevée si @var{start} n'est pas un entier ou si @var{end} n'en est pas un non plus ou ne vaut pas @code{nil}. Une erreur de type @code{args-out-of-range} est signalée si @var{start} indique un caractère qui suit un caractère à l'indice @var{end}, ou si l'un ou l'autre des entiers est hors de la @var{string}.

source: A @dfn{symbol} is an object with a unique name. This chapter describes symbols, their components, their property lists, and how they are created and interned. Separate chapters describe the use of symbols as variables and as function names; see @ref{Variables}, and @ref{Functions}. For the precise read syntax for symbols, see @ref{Symbol Type}.
fr_fr: Un @dfn{symbole} est un objet avec un nom unique. Ce chapitre décrit les symboles, leurs composants, leurs listes de propriétés et comment ils sont créés et conservés. L'utilisation de symboles comme noms de variables ou de fonctions est décrit dans d'autres chapitres ; consultez @ref{Variables} et @ref{Functions}. Pour la syntaxe exacte des symboles, consultez @ref{Le type symbole}.

source: A @dfn{variable} is a name that can hold a value. Although nearly all variables can be set by the user, certain variables exist specifically so that users can change them; these are called @dfn{user options}. Ordinary variables and user options are described using a format like that for functions except that there are no arguments.
fr_fr: Une @dfn{variable} est un nom qui peut contenir une valeur. Bien que presque toutes les variables puissent être initialisées par l'utilisateur, certaines variables existent spécifiquement de sorte que les utilisateurs puissent les changer ; celles-ci s'appellent @dfn{users options}. Des variables ordinaires et les options d'utilisateur sont décrites en utilisant un format comme pour des fonctions sauf qu'il n'y a aucun argument.

source: A Lisp @dfn{object} is a piece of data used and manipulated by Lisp programs. For our purposes, a @dfn{type} or @dfn{data type} is a set of possible objects.
fr_fr: Un @dfn{object} List est un morceau de données employées et manipulées par les programmes Lisp. Pour nous, un @dfn{type} ou un @dfn{data type} est un ensemble d'objets possibles.

source: A Lisp expression that you can evaluate is called a @dfn{form}. Evaluating a form always produces a result, which is a Lisp object. In the examples in this manual, this is indicated with @samp{@result{}}:
fr_fr: Une expression de Lisp que vous pouvez évaluer s'appelle une @dfn{form}. L'évaluation d'un formulaire produit toujours un résultat, qui est un objet de Lisp. Dans les exemples en ce manuel, ceci est indiqué avec @samp{@result{}} :

source: A Sample Function Description
fr_fr: Un exemple d'une description de fonction

source: A Sample Variable Description
fr_fr: Un exemple d'une description de variable

source: A bool-vector is much like a vector, except that it stores only the values @code{t} and @code{nil}. If you try to store any non-@code{nil} value into an element of the bool-vector, the effect is to store @code{t} there. As with all arrays, bool-vector indices start from 0, and the length cannot be changed once the bool-vector is created. Bool-vectors are constants when evaluated.
fr_fr: Un vecteur-booléen est presque comme un vecteur sauf qu'il stocke seulement des valeurs de type @code{t} et la valeur @code{nil}. Si on essaie de stocker une valeur qui n'est pas @code{nil} dans un élément du vecteur-booléen, c'est @code{t} qui s'y trouvera stocké. Comme avec tous les tableaux, les indices du vecteur-booléen commencent à 0 et la longueur ne peut pas être changée une fois que le vecteur-booléen est créé. Les vecteurs-booléen sont des constantes quand ils sont évalués.

source: A case table is a char-table (@pxref{Char-Tables}) whose subtype is @code{case-table}. This char-table maps each character into the corresponding lower case character. It has three extra slots, which hold related tables:
fr_fr: Une table de casse est un char-table (@pxref{Char-Tables}) dont le sous-type est @code{case-table}. Cette char-table associe à chaque caractère son caractère minuscule correspondant. Il dispose de trois emplacements supplémentaires, qui contiennent les ttables en rapport les unes avec des tableaux connexes:

source: A certain amount of Common Lisp emulation is available via the @file{cl} library. @inforef{Top, Overview, cl}.
fr_fr: Une certaine quantité de programmes Lisp Common est disponible par l'intermédiaire de la @file{cl} bibliothèque. @inforef{Top, Overview, cl}.

source: A char-table can also have a @dfn{default value}. If so, then @code{(aref @var{char-table} @var{c})} returns the default value whenever the char-table does not specify any other non-@code{nil} value.
fr_fr: Une char-table peut aussi avoir une valeur par défaut. Dans ce cas, @code{(aref @var{char-table} @var{c})} retourne la valeur par défaut quand la char-table ne spécifie pas une valeur autre que @code{nil}.

source: A char-table can have a @dfn{parent}, which is another char-table. If it does, then whenever the char-table specifies @code{nil} for a particular character @var{c}, it inherits the value specified in the parent. In other words, @code{(aref @var{char-table} @var{c})} returns the value from the parent of @var{char-table} if @var{char-table} itself specifies @code{nil}.
fr_fr: Une char-table peut avoir un @dfn{parent} qui est une autre char-table. Si elle en a un, alors quand la char-table spécifie @code{nil} pour un caractère particulier @var{c}, elle hérite de la valeur spécifiée dans la char-table parente. Autrement dit, @code{(aref char-table c)} retourne la valeur de la char-table parente si @var{char-table}spécifie @code{nil}.

source: A char-table can specify an element value for a single character code; it can also specify a value for an entire character set.
fr_fr: Une char-table peut définir la valeur d'un élément pour un seul code de caractère ; il peut aussi définir la valeur pour tout un ensemble de caractères.

source: A char-table is much like a vector, except that it is indexed by character codes. Any valid character code, without modifiers, can be used as an index in a char-table. You can access a char-table's elements with @code{aref} and @code{aset}, as with any array. In addition, a char-table can have @dfn{extra slots} to hold additional data not associated with particular character codes. Char-tables are constants when evaluated.
fr_fr: Une char-table ressemble à un vecteur mais elle est indexée par les codes de caractères. Tout code de caractère valide, sans modificateurs, peut être utilisé comme indice dans une char-table. On peut accéder aux éléments d'une char-table avec @code{aref} et @code{aset}, comme avec n'importe quel tableau. De plus, une char-table peut avoir des cases supplémentaires (@dfn{extra slots}) pour contenir des données supplémentaires qui ne sont pas associées à des codes de caractères particuliers. Les char-tables sont des constantes quand elles sont évaluées.

source: A definition says how a symbol will be used.
fr_fr: Une définition indique comment un symbole sera utilisé.

source: A description of an imaginary
fr_fr: Une description d'une imaginaire

source: A deterministic computer program cannot generate true random numbers. For most purposes, @dfn{pseudo-random numbers} suffice. A series of pseudo-random numbers is generated in a deterministic fashion. The numbers are not truly random, but they have certain properties that mimic a random series. For example, all possible values occur equally often in a pseudo-random series.
fr_fr: Un programme machine déterministe ne peut pas produire de véritables nombres aléatoires. Dans la plupart des cas, @dfn{pseudo-randam numbers} suffit. Une série de nombres pseudo-aléatoires est produite d'une façon déterminée. Les nombres ne sont pas vraiment aléatoires, mais ils ont certaines propriétés à imiter une série aléatoire. Par exemple, toutes les valeurs possibles se produisent également souvent dans une série pseudo-aléatoire.

source: A format specification is a sequence of characters beginning with a @samp{%}. Thus, if there is a @samp{%d} in @var{string}, the @code{format} function replaces it with the printed representation of one of the values to be formatted (one of the arguments @var{objects}). For example:
fr_fr: Une spécification de format est une suite de caractères commençant par un @samp{%}. Ainsi, s'il existe un @samp{%d} dans @var{string}, la fonction @code{format} le remplace par la représentation affichée d'une des valeurs à formater (un des arguments de @var{objects}). Par exemple :

source: A function is a Lisp program
fr_fr: Une fonction est un programme Lisp

source: A generic character stands for a character set, or a row of a character set; specifying the generic character as argument is equivalent to specifying the character set name. @xref{Splitting Characters}, for a description of generic characters.
fr_fr: Un caractère générique représente un ensemble de caractères ou une rangée d'un ensemble de caractères ; spécifier le caractère générique comme argument est équivalent à spécifier le nom de l'ensemble de caractères. Pour une description des caractères génériques, @xref{Splitting Characters}.

source: A generic character stands for a character set; specifying the generic character as argument is equivalent to specifying the character set name. @xref{Splitting Characters}, for a description of generic characters.
fr_fr: Un caractère générique représente un ensemble de caractères ; spécifier le caractère générique comme argument est équivalent à spécifier le nom de l'ensemble de caractères. @xref{Splitting Characters} pour une description des caractères génériques.

source: A hash table is a very fast kind of lookup table, somewhat like an alist (@pxref{Association Lists}) in that it maps keys to corresponding values. It differs from an alist in these ways:
fr_fr: Une table de hachage est une sorte de table de correspondance très rapide, un peu comme une liste d'association [alist] (@pxref{Association Lists}) du fait qu'elle lie les clés aux valeurs correspondantes. Elle diffère d'une liste d'associations sur les points suivants :

source: A list is a sequence of elements, but it is not a single primitive object; it is made of cons cells, one cell per element. Finding the @var{n}th element requires looking through @var{n} cons cells, so elements farther from the beginning of the list take longer to access. But it is possible to add elements to the list, or remove elements.
fr_fr: Une liste est une suite d'éléments mais n'est pas un objet primitif unique. La liste est constituée de cellules cons avec une seule cellule par élément. Pour trouver l'élément @var{n}, il faut passer les @var{n} cellules avant. Donc plus un élément est loin du début de la liste, plus on mettra de temps à y accéder. Toutefois, il est possible d'ajouter ou d'enlever des éléments à la liste.

source: A more powerful function is @code{store-substring}:
fr_fr: Il existe une fonction plus puissante : @code{store-substring}

source: A negative number counts from the end of the string, so that @minus{}1 signifies the index of the last character of the string. For example:
fr_fr: Un nombre négatif compte à partir de la fin de la chaîne, de telle sorte que -1 représente l'indice du dernier caractère de la chaîne. Par exemple:

source: A non-@code{nil} value of this variable turns on the automatic expansion of abbrevs when their abbreviations are inserted into a buffer. If the value is @code{nil}, abbrevs may be defined, but they are not expanded automatically.
fr_fr: Une valeur non-@code{nil} de cette variable active l'expansion automatique des abréviations quand elles sont insérées dans un tampon. Si la valeur est @code{nil}, des abréviations peuvent être définies, mais elles ne sont pas développées automatiquement.

source: A specification can have a @dfn{width}, which is a signed decimal number between the @samp{%} and the specification character. If the printed representation of the object contains fewer characters than this width, @code{format} extends it with padding. The padding goes on the left if the width is positive (or starts with zero) and on the right if the width is negative. The padding character is normally a space, but it's @samp{0} if the width starts with a zero.
fr_fr: Une spécification peut avoir une @dfn{largeur}, qui est un nombre décimal précisé entre @samp{%} et le caractère de spécification. Si la représentation affichée de l'objet contient moins de caractères que cette largeur, @code{format} la rallonge en faisant du bourrage. Le bourrage va à gauche si la largeur est positive (ou commence par zéro) et à droite si la largeur est négative. Le caractère de bourrage est normalement un espace, mais ce sera @samp{0} si la largeur commence par un zéro.

source: A string in Emacs Lisp is an array that contains an ordered sequence of characters. Strings are used as names of symbols, buffers, and files; to send messages to users; to hold text being copied between buffers; and for many other purposes. Because strings are so important, Emacs Lisp has many functions expressly for manipulating them. Emacs Lisp programs use strings more often than individual characters.
fr_fr: Une chaîne en Lisp Emacs est un tableau qui contient une suite ordonnée de caractères. Les chaînes sont utilisées comme noms de symboles, de mémoires tampons et de fichiers ; pour envoyer des messages aux utilisateurs ; pour contenir le texte copié entre les mémoires tampons ; et pour beaucoup d’autres choses. Puisque les chaînes sont si importantes, Lisp Emacs possède de nombreuses fonctions permettant de les manipuler. Les programmes Lisp Emacs utilisent plus souvent les chaînes que les caractères individuels.

source: A vector, like a string or a number, is considered a constant for evaluation: the result of evaluating it is the same vector. This does not evaluate or even examine the elements of the vector. @xref{Self-Evaluating Forms}.
fr_fr: Un vecteur, comme une chaîne de caractères ou un nombre, est considéré constant pour l'évaluation : le résultat de l'évaluation est le même vecteur. Les éléments du vecteur ne sont pas évalués, ni même examinés. @xref{Self-Evaluating Forms}.

source: Abbrev Expansion
fr_fr: Expansions d'abréviations

source: Abbrev Files
fr_fr: Fichiers d'abréviations

source: Abbrev Mode
fr_fr: Mode abbrev

source: Abbrev Tables
fr_fr: Tables d'abréviations

source: Abbrev mode is a minor mode controlled by the value of the variable @code{abbrev-mode}.
fr_fr: Le mode abbrev est un mode mineur contrôlé par la valeur de la variable @code{abbrev-mode}.

source: Abbrev tables used by various major modes.
fr_fr: Tables d'abréviations employées par divers modes majeurs.

source: Abbrevs And Abbrev Expansion
fr_fr: Abréviations et abréviations expansions

source: Abbrevs and Abbrev Expansion
fr_fr: Abbrevs et expansion d'abbrev

source: Accessing files.
fr_fr: Accès aux fichiers.

source: Acknowledgements
fr_fr: Remerciements

source: Adding to the definition of a function.
fr_fr: Ajout à la définition d'une fonction.

source: Advice and coding conventions for Emacs Lisp.
fr_fr: Conseils et règles de codage pour le Lisp d'Emacs.

source: After Emacs reads your init file, it initializes @code{auto-save-list-file-name} (if you have not already set it non-@code{nil}) based on this prefix, adding the host name and process ID. If you set this to @code{nil} in your init file, then Emacs does not initialize @code{auto-save-list-file-name}.
fr_fr: Après qu'Emacs ait lu votre fichier de configuration, il initialise @code{auto-save-list-file-name} (si vous ne l'avez pas déjà réglé en non-@code{nil}) sur la base de ce préfixe, en ajoutant le nom d'hôte et l'ID de processus. Si vous réglez cette option en @code{nil} dans votre fichier de configuration, Emacs n'initialisera pas @code{auto-save-list-file-name}.

source: After defining @var{name} in this way, you can use it as the @var{test} argument in @code{make-hash-table}. When you do that, the hash table will use @var{test-fn} to compare key values, and @var{hash-fn} to compute a ``hash code'' from a key value.
fr_fr: Après avoir défini @var{name} de cette façon, on peut l'utiliser en argument @var{test} dans @code{make-hash-table}. Quand on fait cela, la table de hachage utilise @var{test-fn} pour comparer les valeurs des clés, et @var{hash-fn} pour calculer un``code de hachage'' à partir d'une valeur de clé.

source: All four kinds of array share these characteristics:
fr_fr: Ces quatre types de tableaux partagent les caractéristiques suivantes :

source: All of these functions except @code{%} return a floating point value if any argument is floating.
fr_fr: Toutes ces fonctions, à part @code{%}, retourne une valeur à virgule flottante si au moins un argument est une valeur à virgule flottante.

source: All the specification characters allow an optional @dfn{precision} before the character (after the width, if present). The precision is a decimal-point @samp{.} followed by a digit-string. For the floating-point specifications (@samp{%e}, @samp{%f}, @samp{%g}), the precision specifies how many decimal places to show; if zero, the decimal-point itself is also omitted. For @samp{%s} and @samp{%S}, the precision truncates the string to the given width, so @samp{%.3s} shows only the first three characters of the representation for @var{object}. Precision has no effect for other specification characters.
fr_fr: Tous les caractères de spécification permettent une option @dfn{precision} avant le caractère (après la largeur, s'il y en a une). La précision est un point décimal @samp{.} suivi par digit-string. Pour les spécifications à virgule flottante (@samp{%e}, @samp{%f}, @samp{%g}), la précision spécifie le nombre de décimales à afficher; si c'est zéro, le point décimal est lui aussi supprimé. Pour @samp{%s} et @samp{%S}, la précision tronque la chaîne à la largeur donnée, donc @samp{%.3s} affiche seulement les trois premiers caractères de la représentation de @var{object}. L'option précision n'a pas d'effet sur les autres caractères de spécification.

source: Altering the contents of an existing string.
fr_fr: Changer le contenu d'une chaîne existante.

source: An @code{arith-error} results if @var{divisor} is 0.
fr_fr: Un @code{arith-error} est généré quand @var{divisor} est 0.

source: An @dfn{array} is a single primitive object that has a slot for each of its elements. All the elements are accessible in constant time, but the length of an existing array cannot be changed. Strings, vectors, char-tables and bool-vectors are the four types of arrays.
fr_fr: Un tableau @dfn{array} est un objet primitif unique qui dispose d'une case pour chacun de ses éléments. Tous les éléments sont accessibles tout le temps mais la longueur d'un tableau existant peut être changée. Les chaînes de caractères, les vecteurs, les tables de caractères et les vecteurs-booléens représentent les quatre types de tableaux.

source: An @dfn{array} object has slots that hold a number of other Lisp objects, called the elements of the array. Any element of an array may be accessed in constant time. In contrast, an element of a list requires access time that is proportional to the position of the element in the list.
fr_fr: Un objet @dfn{array} possède des cases qui contiennent un certain nombre d'autres objets Lisp, appelés les éléments du tableau. Tout élément d'un tableau a le même temps d'accès. En revanche, un élément d'une liste nécessite un temps d'accès proportionnel à la position de l'élément dans la liste.

source: An abbrev table is represented as an obarray containing a symbol for each abbreviation. The symbol's name is the abbreviation; its value is the expansion; its function definition is the hook function to do the expansion (@pxref{Defining Abbrevs}); its property list cell typically contains the use count, the number of times the abbreviation has been expanded. Alternatively, the use count is on the @code{count} property and the system-abbrev flag is on the @code{system-type} property. Abbrevs with a non-@code{nil} @code{system-type} property are called ``system'' abbrevs. They are usually defined by modes or packages, instead of by the user, and are treated specially in certain respects.
fr_fr: Une table d'abréviation est représentée par une liste contenant un symbole pour chaque abréviation. Le nom du symbole est l'abréviation ; sa valeur est l'expansion ; sa définition de fonction est la fonction hook devant faire l'expansion (@pxref{Defining Abbrevs}) ; sa cellule de liste de propriété contient typiquement le compteur d'utilisation, le nombre de fois que l'abréviation a été développée. Alternativement, le compteur d'utilisation pointe vers la propriété @code{count} et le drapeau de system-abbrev pointe vers la propriété @code{system-type}. Les abréviations avec la propriété non-@code{nil} @code{system-type} s'appellent les abréviations de « système ». Elles sont habituellement définies par des modes ou des paquets, non par l'utilisateur, et traitées spécialement à certains égards.

source: An abbreviation or @dfn{abbrev} is a string of characters that may be expanded to a longer string. The user can insert the abbrev string and find it replaced automatically with the expansion of the abbrev. This saves typing.
fr_fr: Une abréviation ou @dfn{abbrev} est une chaîne de caractères qui peut être développée dans une chaîne plus longue. L'utilisateur peut insérer la chaîne d'abréviation et se rendre compte qu'elle a été remplacée automatiquement avec l'expansion de l'abréviation. Ceci améliore la dactylographie.
